/* 链表教学
大白话理解：数组 vs 链表：
数组（vector/list）= 联排酒店
所有房间号挨在一起，编号是 0，1，2，3...
优点：如果你要找 5 号房间，直接推门进去就行（速度极快，O(1))
缺点：如果要在中间加塞一个新房间，或者抽掉一个房间，后面的所有人都要跟着大搬家（速度极慢，O(N)），而且酒店必须一开始就建好一片空地（连续内存）。
链表（Linked List）= 寻宝游戏
每个人（节点）都站在城市里的不同的、随机的地方（内存不连续）
每个人手里捏着一张小纸条，纸条上写的是下一个人的家庭住址
你要找到第5个人，只能先找到第1个人，问出第2个人的地址，走到第2个人那里，再问第3个...，必须从头一个个找，速度慢，0(N)
优点：如果想在中间加一个人，或者踢掉一个人，根本不需要大搬家。
只要把前一个人手里的纸条改掉，让他指向新来的人（极快，O(1)，新来的这个再指向原来前一个指向的人就行
*/

#include <iostream>
#include <vector>
using namespace std;

// 链表在C++ 里长啥样子
// 在C++里，链表的一个“人”，叫做节点Node，就是用结构体或类来表示的
struct ListNode
{
    int val; //数据域：这个节点所存的数据
    ListNode* next;  // 指针域：纸条 指向下一个节点的内存地址
    // ListNode 是刚才用 struct 自定义出来的结构体类型。既然是类型，就可以像 int、double 一样，在它后面加 * 变成指针
    ListNode(int x):val(x),next(nullptr) 
    {

    }
    // 构造函数 ListNode(int x)：意思是接收一个整数 x 
    // : val(x)：把传进来的 x 赋值给成员变量 val
    // next(nullptr)：把指针初始化为空 极其重要！防止野指针
};

// val：存你的数据（比如数字 1、2、3）
// next：这是一个指针！它存的是下一个节点的内存地址
// 头节点（Head）：只要抓住 head，就能顺藤摸瓜找到所有节点 如果 head 是 nullptr，就代表这个链表是空的

// 3.在内存里，它到底是怎么连起来的
// 假设我们要存[1,2,3]
// 数组的内存是紧挨着的
// [1,2,3]——地址：0x100 0x104 0x108
// 链表的内存：散落各地 靠指针相连
//   节点1（地址0x500）：val=1，next指向0x800
//   节点2（地址0x800）：val=2，next指向0x200
//   节点3（地址0x200）：val=3，next指向nullptr
// 它们在内存里完全不挨着！这就是为什么不能用 head[1] 去访问第二个节点，只能用 head->next

// 4.链表最大的两个坑
// （1）找不到回头路 
// （2）内存泄漏（C++专属）如果你想删除一个节点，除了让前一个节点跳过它，你还必须手动 delete 掉这块内存，否则就会内存泄漏

// 5.代码演示：

int main()
{
// 构造3个节点
ListNode* n1 = new ListNode(1); //给我造一个名叫 n1 的指针，去堆区新建一个值为 1 的节点，然后把该节点的门牌号拿回来给 n1 保管
ListNode* n2 = new ListNode(2);
ListNode* n3 = new ListNode(3);

// 把3个节点连接起来
n1->next = n2;
n2->next = n3;
n3->next = nullptr; // 最后一个指向空

ListNode* head = n1; // 把头指针指向第一个节点

cout << head->next->val <<endl;
}