/*数据结构      	            底层原理	      是否自动排序	         查找速度	           对应关系
C++ std::map                    红黑树          有序Key从小到大         O(log n)        类似 Python 的 SortedDict
C++ std::unordered_map          哈希表           无序 随机            O(1)~O(n)         完全对应 Python 的 dict
Python dict                     同上               同上                 同上             对应 C++ unordered_map
                  
什么是空间复杂度：
你的算法在运行过程中，额外向内存借用了多少“地盘”
O(1) 常量级 不管你输入的数据是 10 个还是 100 万个，我额外占用的内存都是固定的
O(n) 线性级 输入数据有n个，你就要额外借用n个大小的内存

异或 XOR：^
三个无敌定律：
1.自己和自己异或，灰飞烟灭：a ^ a = 0
2.和0异或 等于自己：a ^ 0 = a
3.谁先谁后无所谓 即满足交换律

例子：给一个数组[4, 1, 2, 1, 2] 你拿一个变量 ans = 0 去跟他们挨个异或：
0^4=4
4^1=4^1
4^1^2=4^1^2
4^1^2^1=4^2
4^2^2=4
*/